Table of Contents
 Enum IntDiagCheckMethod
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
Flags controlling the method of the check by a interaction diagram
public enum IntDiagCheckMethod
Fields
IDCheckTypeNMuMu = 4
know Ned; calculate +-Mrd
IDCheckTypeNuMM = 2
know Med; calculate +-Nrd
IDCheckTypeNuMuMu = 1
known Ned,Med; calculate Nrd,Mrd as intersection of ID and line=[0,0];[Ned,Med]
IDOnlyPlanarCheck = 16
Only planar check is required
IDOnlyUlsForce1 = 8
Find intersection only in the direction of the Fd
IDPlanar_0deg = 64
used by CheckForceQuick
IDPlanar_90deg = 128
used by CheckForceQuick
IDPlaneInfoRequest = 32
Information about plane of deformation is required
Fields
 Name |  Description
 IDCheckTypeNMuMu = 4
know Ned; calculate +-Mrd
 IDCheckTypeNuMM = 2
know Med; calculate +-Nrd
 IDCheckTypeNuMuMu = 1
known Ned,Med; calculate Nrd,Mrd as intersection of ID and line=[0,0];[Ned,Med]
 IDOnlyPlanarCheck = 16
Only planar check is required
 IDOnlyUlsForce1 = 8
Find intersection only in the direction of the Fd
 IDPlanar_0deg = 64
used by CheckForceQuick
 IDPlanar_90deg = 128
used by CheckForceQuick
 IDPlaneInfoRequest = 32
Information about plane of deformation is required
 Edit this page